ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB3/peripheral_driver/inc/pca_0.h
/******************************************************************************
 * Copyright (c) 2014 by Silicon Laboratories Inc. All rights reserved.
 *
 * http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
 *****************************************************************************/

#ifndef __PCA_0_H__
#define __PCA_0_H__


#include "efm8_config.h"
#include "SI_EFM8UB3_Register_Enums.h"

/**************************************************************************//**
 * @addtogroup pca_0 PCA0 Driver
 * @{
 *
 * @brief Peripheral driver for PCA0
 *
 * # Introduction #
 *
 * This module contains all the driver content for PCA0
 *
 * @warning The WDT0 module on this device interacts with the PCA.
 *
 * ### Memory Usage ###
 *
 * The table below shows the memory consumption of the library with various
 * options. The 'default' entry shows the consumption when most or all available
 * functions are called. Typical consumption is expected to be less than this
 * since there are normally many uncalled functions that will consume no
 * resources.
 *
 * @note It is possible for memory usage to exceed the listed values in rare cases
 *
 * | condition          | CODE | XRAM | IRAM | RAM |
 * |--------------------|------|------|------|-----|
 * |default             |  606 |    0 |    0 |   0 |
 *
 * # Theory of Operation #
 *
 * The Programable counter array provides 3 main catagories of functionality.
 *
 * - PWM
 * - Counter/capture
 * - Timer
 *
 * It consists of a single counter/timer and several channels which all operate
 * using the single counter.
 *
 * ### Timer operations ###
 *
 *  The PCA can be used to provide basic timer operations. The timer period
 * is determined by the timer configuration. Each PCA channel may fire an
 * interrupt at an independent point in the period. For example We may set up
 * the timer to overflow (and provide an interrupt) every 100 cycles. We can
 * then configure on channel to provide an interrupt at 90 cycles and another
 * at 50 cycles. This would generate a 'half-way' and 'early-warning'
 * interrupts.
 *
 * ### PWM operations ###
 *
 * The PCA can be configured to output PWM waveforms (or square waveforms).
 * The period of the PWM is controlled by the time an thus the same for all
 * channels. The duty cycle and polarity is controlled by each channel
 * independently.
 *
 *  A related mode is high frequency output mode where each PCA channel can be
 * configured to toggle it's output ever N ticks of the timer. This allows
 * each module to independently generate a digital frequency.
 *
 * ### Capture operations ###
 *
 * The state of the timer can be captured by a PCA channel based on several
 * triggers. The captured value can then be used for various operations.
 *
 * For example if channel 0 captures on the rising edge of a signal and
 * channel 0 captures on the falling edge of that same signal then the
 * high pulse with time can be calculated by the equation.
 *   time = (ch1_value - ch0_value) * period_of_timer
 *
 * Another mode of operation is to
 *
 * ### Watch Dog Timer ###
 *
 * While the Peripheral Driver Library defines a separate module for interacting with the
 * watch-dog timer the WDT is physically located in channel 4 of the PCA on this device.
 * Any changes to the counter in the WDT or PCA block will effect the other block. In
 * addition when the WDT is in used PCA channel 4 is unavailable.
 *
 * Runtime asserts have been placed in this module to help highlight cases where the
 * WDT and PCA interfere with one another. However it is not possible to catch all
 * issues and the user needs to be aware of this interaction.
 *
 * ### Hardware Configuration ###
 *
 * This driver provides basic facilities for configuring the PCA.
 * it is recommended that Simplicity Hardware Configurator be for more
 * advanced configuration as it provides more comprehensive validation
 * of user selections.
 *
 *****************************************************************************/

//Option macro documentation
/**************************************************************************//**
 * @addtogroup pca0_config Driver Configuration
 * @{
 *
 * @brief
 *    Driver configuration constants read from efm8_config.h
 * 
 *  This peripheral driver will look for configuration constants in 
 *  **efm8_config.h**. This file is provided/written by the user and should be 
 *  located in a directory that is part of the include path. 
 *  
 *****************************************************************************/

/**************************************************************************//**
 * @def EFM8PDL_PCA0_AUTO_PAGE
 * @brief Controls if the library handles SI_SFR paging.
 *
 * When '1' the PCA0 driver automatically handles setting and restoring
 * SI_SFR page for each call. When disabled the library consumes less code
 * space but the user must ensure that the correct page is set when calling
 * driver functions that access hardware.
 *
 * Default setting is '1' and may be overridden by defining in 'efm8_config.h'.
 *
 *****************************************************************************/

/**************************************************************************//**
 * @def EFM8PDL_PCA0_USE_ISR
 * @brief Controls inclusion of PCA0 ISR and associated callbacks.
 *
 * When '1' the PCA0 ISR in the driver is used and callbacks are functional.
 *
 * Default setting is '1' and may be overridden by defining in 'efm8_config.h'.
 *
 *****************************************************************************/
/**  @} (end addtogroup pca0_config Driver Configuration) */

//Configuration defaults
#ifndef IS_DOXYGEN
  #define IS_DOXYGEN 0
#endif

#ifndef EFM8PDL_PCA0_AUTO_PAGE
#define EFM8PDL_PCA0_AUTO_PAGE 1
#endif
#ifndef EFM8PDL_PCA0_USE_ISR
  #define EFM8PDL_PCA0_USE_ISR 1
#endif

// Runtime API
/**************************************************************************//**
 * @addtogroup pca0_runtime PCA0 Runtime API
 * @{
 *****************************************************************************/

/// PCA Channel Enumeration
typedef enum
{
  PCA0_CHAN0 = 0x0,         //!<  PCA Channel 0
  PCA0_CHAN1 = 0x1,         //!<  PCA Channel 1
  PCA0_CHAN2 = 0x2,         //!<  PCA Channel 2

#if IS_DOXYGEN
  PCA0_CHAN3 = -1,          //!< @warning NOT SUPPORTED ON THIS DEVICE
  PCA0_CHAN4 = -1,          //!< @warning NOT SUPPORTED ON THIS DEVICE
  PCA0_CHAN5 = -1,          //!< @warning NOT SUPPORTED ON THIS DEVICE
#endif
} PCA0_Channel_t;

/**************************************************************************//**
 * @addtogroup pca0_if Interrupt Flag Enums
 * @{
 *****************************************************************************/
#define PCA0_OVERFLOW_IF  PCA0CN0_CF__BMASK    //!<  Counter overflow flag
#define PCA0_IOVERFLOW_IF PCA0PWM_COVF__BMASK  //!<  Intermediate overflow flag
#define PCA0_CHAN0_IF     PCA0CN0_CCF0__BMASK  //!<  Channel 0
#define PCA0_CHAN1_IF     PCA0CN0_CCF1__BMASK  //!<  Channel 1
#define PCA0_CHAN2_IF     PCA0CN0_CCF2__BMASK  //!<  Channel 2

#if IS_DOXYGEN
  #define PCA0_CHAN3_IF -1 //!< @warning NOT SUPPORTED ON THIS DEVICE
  #define PCA0_CHAN4_IF -1 //!< @warning NOT SUPPORTED ON THIS DEVICE
  #define PCA0_CHAN5_IF -1 //!< @warning NOT SUPPORTED ON THIS DEVICE
#endif
/**  @} (end addtogroup pca0_if Interrupt Flag Enums) */

/**************************************************************************//**
 * @brief Return the value of the specified interrupt flag
 *
 * @return
 * The state of the flags. This value is the OR of all flags which are set.
 *
 * Valid enums can be fond in the Interrupt Flag Enums group.
 *
 ******************************************************************************/
uint8_t PCA0_getIntFlags();

/***************************************************************************//**
 * @brief
 * Clear the specified status flag
 *
 * @param flag:
 * Flag to clear. Multiple flags can be cleared by OR-ing the flags.
 *
 * Valid enums can be found in the Interrupt Flag Enums group.
 ******************************************************************************/
void PCA0_clearIntFlag(uint8_t flag);

/***************************************************************************//**
 * @brief
 * Enable or disable the PCA interrupts
 *
 * @param flag:
 * Interrupt to be enabled/disabled
 * @param enable:
 * New target status (true to enable)
 *
 * Multiple interrupts may be enabled/disabled at a time by or-ing their flags
 *
 * Valid enums can be found in the Interrupt Flag Enums group.
 *
 ******************************************************************************/
void PCA0_enableInt(uint8_t flag, bool enable);

/***************************************************************************//**
 * @brief
 * Read the channel capture/compare register
 *
 * @param channel:
 * Channel to read.
 *
 * @return
 * Current value of capture/compare register for the specified channel.
 ******************************************************************************/
uint16_t PCA0_readChannel(PCA0_Channel_t channel);

/***************************************************************************//**
 * @brief
 * Write the channel capture.compare register
 *
 * @param channel:
 * Channel to read.
 * @param value:
 * Value to write to capture/compare register.
 *
 ******************************************************************************/
void PCA0_writeChannel(PCA0_Channel_t channel, uint16_t value);

/***************************************************************************//**
 * @brief
 * Read the PCA counter.
 *
 * @return
 * Current value of the PCA counter.
 ******************************************************************************/
uint16_t PCA0_readCounter();

/***************************************************************************//**
 * @brief
 * Write to the PCA counter.
 *
 * @param value:
 * Value to write to PCA counter.
 *
 ******************************************************************************/
void PCA0_writeCounter(uint16_t value);

/***************************************************************************//**
 * @brief
 * Start the PCA Counter.
 *
 ******************************************************************************/
void PCA0_run();

/***************************************************************************//**
 * @brief
 * Stop the PCA Counter.
 *
 ******************************************************************************/
void PCA0_halt();

/**  @} (end addtogroup pca0_runtime PCA0 Runtime API) */

// Initialization API
/**************************************************************************//**
 * @addtogroup pca0_init PCA0 Initialization API
 * @{
 *****************************************************************************/

/// @brief Clock Selection Enum.
typedef enum
{
  PCA0_SYSCLK_DIV12 = PCA0MD_CPS__SYSCLK_DIV_12, //!< Select SystemClock/12
  PCA0_SYSCLK_DIV4 = PCA0MD_CPS__SYSCLK_DIV_4,   //!< Select SystemClock/4
  PCA0_TIMER0      = PCA0MD_CPS__T0_OVERFLOW,    //!< Select Timer0 Overflow
  PCA0_ECI         = PCA0MD_CPS__ECI,            //!< Select ECI falling edge
  PCA0_SYSCLK      = PCA0MD_CPS__SYSCLK,         //!< Select SystemClock
  PCA0_EXTOSC_DIV8 = PCA0MD_CPS__EXTOSC_DIV_8,   //!< Select ExternalOsc/8
  PCA0_LFOSC_DIV8  = PCA0MD_CPS__LFOSC_DIV_8,    //!< Select LowFrequencyOsc/8
} PCA0_Timebase_t;

/// @brief Channel mode enum.
typedef enum
{
  //xx10 000* (CPM) 0x20
  //0x*0 0xxx (PWM)
  PCA0_CAPTURE_POS_CEX   = PCA0CPM0_PWM16__8_BIT //!< Capture mode triggered by CEX rising
                           | PCA0CPM0_ECOM__DISABLED
                           | PCA0CPM0_CAPP__ENABLED
                           | PCA0CPM0_CAPN__DISABLED
                           | PCA0CPM0_MAT__DISABLED
                           | PCA0CPM0_TOG__DISABLED
                           | PCA0CPM0_PWM__DISABLED,

  //xx01 000* (CPM) 0x10
  //0x*0 0xxx (PWM)
  PCA0_CAPTURE_NEG_CEX   = PCA0CPM0_PWM16__8_BIT //!< Capture mode triggered by CEX falling
                           | PCA0CPM0_ECOM__DISABLED
                           | PCA0CPM0_CAPP__DISABLED
                           | PCA0CPM0_CAPN__ENABLED
                           | PCA0CPM0_MAT__DISABLED
                           | PCA0CPM0_TOG__DISABLED
                           | PCA0CPM0_PWM__DISABLED,

  //xx11 000* (CPM) 0x30
  //0x*0 0xxx (PWM)
  PCA0_CAPTUE_TOGGLE_CEX = PCA0CPM0_PWM16__8_BIT //!< Capture Mode triggered by CEX rising or falling
                           | PCA0CPM0_ECOM__DISABLED
                           | PCA0CPM0_CAPP__ENABLED
                           | PCA0CPM0_CAPN__ENABLED
                           | PCA0CPM0_MAT__DISABLED
                           | PCA0CPM0_TOG__DISABLED
                           | PCA0CPM0_PWM__DISABLED,

