ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB3/peripheral_driver/inc/pca_0.h
  //x100 100* (CPM) 0x48
  //0x*0 0xxx (PWM)
  PCA0_TIMER             = PCA0CPM0_PWM16__8_BIT //!< Timer mode
                           | PCA0CPM0_ECOM__ENABLED
                           | PCA0CPM0_CAPP__DISABLED
                           | PCA0CPM0_CAPN__DISABLED
                           | PCA0CPM0_MAT__ENABLED
                           | PCA0CPM0_TOG__DISABLED
                           | PCA0CPM0_PWM__DISABLED,

  //x100 110* (CPM) 0x4C
  //0x*0 0xxx (PWM)
  PCA0_HIGH_SPEED_OUT    = PCA0CPM0_PWM16__8_BIT //!< High speed output mode
                           | PCA0CPM0_ECOM__ENABLED
                           | PCA0CPM0_CAPP__DISABLED
                           | PCA0CPM0_CAPN__DISABLED
                           | PCA0CPM0_MAT__ENABLED
                           | PCA0CPM0_TOG__ENABLED
                           | PCA0CPM0_PWM__DISABLED,

  //x100 011* (CPM) 0x46
  //0x*0 0xxx (PWM)
  PCA0_FREQUENCY_OUT     = PCA0CPM0_PWM16__8_BIT //!< High frequency output mode
                           | PCA0CPM0_ECOM__ENABLED
                           | PCA0CPM0_CAPP__DISABLED
                           | PCA0CPM0_CAPN__DISABLED
                           | PCA0CPM0_MAT__DISABLED
                           | PCA0CPM0_TOG__ENABLED
                           | PCA0CPM0_PWM__ENABLED,

  //0111 101* (CPM) 0x4A
  //10*0 0000 (PWM) 0x80
  PCA0_PWM8              = PCA0CPM0_PWM16__8_BIT //!< 8-bit PWM (edge aligned)
                           | PCA0CPM0_ECOM__ENABLED
                           | 0x30 //Code for n-bit PWM
                           | PCA0PWM_CLSEL__8_BITS,

  PCA0_PWM8_CENTER       = PCA0CPM0_PWM16__8_BIT //!< 8-bit PWM (center aligned)
                           | PCA0CPM0_ECOM__ENABLED
                           | 0x30 //Code for n-bit PWM
                           | PCA0PWM_CLSEL__8_BITS
                           | 0x08, //center alignment

  //0111 101* (CPM) 0x4A
  //10*0 0001 (PWM) 0x81
  PCA0_PWM9              = PCA0CPM0_PWM16__8_BIT //!< 9-bit PWM (edge aligned)
                           | PCA0CPM0_ECOM__ENABLED
                           | 0x30 //Code for n-bit PWM
                           | PCA0PWM_CLSEL__9_BITS,

  PCA0_PWM9_CENTER       = PCA0CPM0_PWM16__8_BIT //!< 9-bit PWM (center aligned)
                           | PCA0CPM0_ECOM__ENABLED
                           | 0x30 //Code for n-bit PWM
                           | PCA0PWM_CLSEL__9_BITS
                           | 0x08, //center alignment

  //0111 101* (CPM) 0x4A
  //10*0 0010 (PWM) 0x82
  PCA0_PWM10             = PCA0CPM0_PWM16__8_BIT //!< 10-bit PWM (edge aligned)
                           | PCA0CPM0_ECOM__ENABLED
                           | 0x30 //Code for n-bit PWM
                           | PCA0PWM_CLSEL__10_BITS,

  PCA0_PWM10_CENTER      = PCA0CPM0_PWM16__8_BIT //!< 10-bit PWM (center aligned)
                           | PCA0CPM0_ECOM__ENABLED
                           | 0x30 //Code for n-bit PWM
                           | PCA0PWM_CLSEL__10_BITS
                           | 0x08, //center alignment

  //0111 101* (CPM) 0x4A
  //10*0 0011 (PWM) 0x83
  PCA0_PWM11             = PCA0CPM0_PWM16__8_BIT //!< 11-bit PWM (edge aligned)
                           | PCA0CPM0_ECOM__ENABLED
                           | 0x30 //Code for n-bit PWM
                           | PCA0PWM_CLSEL__11_BITS,

  PCA0_PWM11_CENTER      = PCA0CPM0_PWM16__8_BIT //!< 11-bit PWM (center aligned)
                           | PCA0CPM0_ECOM__ENABLED
                           | 0x30 //Code for n-bit PWM
                           | PCA0PWM_CLSEL__11_BITS
                           | 0x08, //center alignment

  //1111 101* (CPM) 0xCA
  //00*0 0xxx (PWM) 0x00
  PCA0_PWM16             = PCA0CPM0_PWM16__16_BIT //!< 16-bit PWM (edge aligned)
                           | PCA0CPM0_ECOM__ENABLED
                           | 0x30 //Code for n-bit PWM
                           | PCA0PWM_CLSEL__11_BITS,
                           //1111 101* (CPM) 0xCA
                           //00*0 0xxx (PWM) 0x00

  PCA0_PWM16_CENTER      = PCA0CPM0_PWM16__16_BIT //!< 16-bit PWM (center aligned)
                           | PCA0CPM0_ECOM__ENABLED
                           | 0x30 //Code for n-bit PWM
                           | PCA0PWM_CLSEL__11_BITS
                           | 0x08, //center alignment
} PCA0_ChannelMode_t;


/// @brief Output Polarity enum.
typedef enum
{
  PCA0_NORMAL_POLARITY   = 0x0, //!< normal channel out
  PCA0_INVERT_POLARITY   = 0x1, //!< normal channel out
} PCA0_ChannelOutPolatiry_t;

/// @brief Idle state of PCA Counter
typedef enum
{
  PCA0_IDLE_RUN     = PCA0MD_CIDL__NORMAL,  //!< PCA runs when idle
  PCA0_IDLE_SUSPEND = PCA0MD_CIDL__SUSPEND, //!< PCA suspended when idle
} PCA0_IdleState_t;


/***************************************************************************//**
 * @brief Initialize the PCA
 *
 * @param timebase:
 * Timebase selection.
 * @param idleState:
 * Idle state selection.
 *
 * @todo:
 * remove idle state selection? Should be ON most of the time.
 *
 ******************************************************************************/
void PCA0_init(PCA0_Timebase_t  timebase, PCA0_IdleState_t idleState);

/**************************************************************************//**
 * @brief 
 * Initialize the PCA Channel.
 *
 * @param channel: 
 * The channel to initialize.
 * @param mode: 
 * The desired mode for this channel.
 * @param pol: 
 * Desired output polarity for this channel.
 *
 * This function initialized the PCA channel including setting up
 * the shared PCA0PWM register.
 *
 * @warning All channels in 8-11 bit PWM mode must be in the same
 * mode. You can not use 8-bit PWM for one channel and 11-bit PWM
 * for another. The N-bit PWM mode will be set to whatever was
 * specified in the last call to PCA0_init Channel.
 *
 *****************************************************************************/
void PCA0_initChannel(PCA0_Channel_t channel,
                      PCA0_ChannelMode_t  mode,
                      PCA0_ChannelOutPolatiry_t pol
                      );
/***************************************************************************//**
 * @brief
 * Restore the PCA to it's uninitialized (reset) state.
 *
 * This function restores the entire PCA INCLUDING ALL CHANNELS to default values.
 ******************************************************************************/
void PCA0_reset();

/***************************************************************************//**
 * @brief
 * Restore the PCA Channel to it's uninitialized (reset) state.
 *
 * @param channel:
 * Channel to reset;
 *
 * This function restores only the specified channels to the reset state.
 ******************************************************************************/
void PCA0_resetChannel(PCA0_Channel_t channel);

/**  @} (end addtogroup pca0_init PCA0 Initialization API) */

//=========================================================
// ISR API
//=========================================================
#if (EFM8PDL_PCA0_USE_ISR == 1) || IS_DOXYGEN
/**************************************************************************//**
 * @def void PCA0_ISR()
 * @brief PCA Interrupt handler (not a callback).
 *
 * This ISR is provided by the library when EFM8PDL_PCA0_USE_ISR = "1".
 *
 *****************************************************************************/
#endif //EFM8PDL_PCA0_USE_ISR

