ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB3/peripheral_driver/inc/pca_0.h
// Callbacks
/**************************************************************************//**
 * @addtogroup pca0_callback User Callbacks
 * @{
 *****************************************************************************/
#if (EFM8PDL_PCA0_USE_ISR == 1) || IS_DOXYGEN

/***************************************************************************//**
 * @addtogroup pca0_callbacks_isr ISR API
 * @{
 *
 * These callbacks will be called by the library when
 * EFM8PDL_PCA0_USE_ISR. If the ISR Api is disabled
 * the callbacks do not need to be provided by the user.
 *
 *****************************************************************************/

/***************************************************************************//**
 * @brief
 * Callback for overflow of PCA.
 *
 * This function is defined by the user and called by the peripheral driver the PCA counter overflows.
 *
 * @warning
 * This function is called from an ISR and should be as short as possible.
 *
 ******************************************************************************/
extern void PCA0_overflowCb();

/***************************************************************************//**
 * @brief 
 * Callback for intermediate overflow of PCA.
 *
 * This function is defined by the user and called by the peripheral driver the PCA counter overflows.
 *
 * @warning 
 * This function is called from an ISR and should be as short as possible
 *
 ******************************************************************************/
extern void PCA0_intermediateOverflowCb();


/***************************************************************************//**
 * @brief 
 * Callback for channel 0 events.
 *
 * This function is defined by the user and called when there is a capture
 * or compare event on channel 0
 *
 * @warning
 * This function is called from an ISR and should be as short as possible.
 *
 ******************************************************************************/
extern void PCA0_channel0EventCb();

/***************************************************************************//**
 * @brief
 * Callback for channel 1 events.
 *
 * This function is defined by the user and called when there is a capture
 * or compare event on channel 1
 *
 * @warning
 * This function is called from an ISR and should be as short as possible.
 *
 ******************************************************************************/
extern void PCA0_channel1EventCb();

/***************************************************************************//**
 * @brief
 * Callback for channel 2 events.
 *
 * This function is defined by the user and called when there is a capture
 * or compare event on channel 2
 *
 * @warning
 * This function is called from an ISR and should be as short as possible.
 *
 ******************************************************************************/
extern void PCA0_channel2EventCb();

/**************************************************************************//**
 * @def void PCA0_channel3EventCb()
 * @warning NOT SUPPORTED ON THIS DEVICE
 *****************************************************************************/

/**************************************************************************//**
 * @def void PCA0_channel4EventCb()
 * @warning NOT SUPPORTED ON THIS DEVICE
 *****************************************************************************/

/**************************************************************************//**
 * @def void PCA0_channel5EventCb()
 * @warning NOT SUPPORTED ON THIS DEVICE
 *****************************************************************************/

#endif //EFM8PDL_PCA0_USE_ISR
/**  @} (end addtogroup pca0_callbacks_isr ISR API) */
/**  @} (end addtogroup pca0_callback User Callbacks) */
/**  @} (end addtogroup PCA0 Driver) */
#endif //__PCA_0_H__
